0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform  0.02;

boundaryField
{
    inlet
    {
        type            	freestream;
	freestreamValue         $internalField;
    }

    outlet
    {
        type            	freestream;
	freestreamValue         $internalField;
    }

    airfoil
    {
	 type            	nutUSpaldingWallFunction;
         value           	uniform 0;     
    }

    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
