system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\																
| =========                 |                                                 |																
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																
|  \\    /   O peration     | Files are generated by Thien Phan               |																
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 |																
\*---------------------------------------------------------------------------*/																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
convertToMeters	1	;														
																
geometry																
{																
}																

